/*
	Name: 
	Copyright: 
	Author: 
	Date: 30/11/18 22:41
	Description: 在纯粹的c语言中，确实可以把二维数组的数组名作为一个指针，
	指向第一行，也指向第一行第一列 
	可以将其指向第一行第一列的性质用上，即可实现使用一个指针访问整个二维数组 
C语言中使用指针访问二维数组_百度经验  
https://jingyan.baidu.com/article/1612d500857db1e20e1eeec4.html
*/
#include<stdio.h>

void main() {
    int a[2][3] = {{1,2,3},{4,5,6}};

    int *p = a;/*   p记录了二维数组的第一行第一列元素的地址*/
    printf("p+1之前：%d\n",p);
    int (*p2)[3] = NULL;/*建立了一个二维数组，p2是该数组名，数组里的元素都是整型*/
   	/*p++;*/
    /*printf("p+1之后：%d\n",p);*/
    p2 = a;/*这一句可以理解为二维数组a复制到二维数组p2中去，
	但其实也没有复制，
	使用的是同一个地址，相当于一个二维数组，有两个变量名*/
    
	printf("\n");
	printf("p2[0]的值:%x\n", p2[0]);
    printf("p2[0][0]的地址:%x\n",&p2[0][0]);
    printf("p2[0][0]的值:%d\n", p2[0][0]);
    printf("p2[0][0]的值:%d\n", (*p2)[0]);/* 1 */
    printf("p2[0][1]的值:%d\n", (*p2 + 1)[1]);
   /* printf("p2[0][0]的值:%d\n", *p);
    printf("a[1][2]的值:%d\n", *(p + 1*3 + 2));*/
    
    printf("\n");
    printf("a[0]的值:%x\n",a[0]);
    printf("a[0][0]的地址:%x\n",&a[0][0]);
    printf("a[0][0]的值:%x\n", a[0][0]);
    printf("a[0][0]的值:%d\n", *p);
    printf("a[1][2]的值:%d\n", *(p + 1*3 + 2));/*访问二维数组成功*/
    /*printf("a[0][0]的值:%d\n", *a); 因为a有两层含义，
	所以解指针失灵了？，反正p能成功，a就失败了*/
    printf("a的值:%x\n",a);

}
